### Import Pandas Library

In [2]:
import pandas as pd

### Read CSV File

In [3]:
data = pd.read_csv('Suicidesindia2001-2012.csv')
data

,State,Year,Type_code,Type,Gender,Age_group,Total
0,A & N Islands,2001,Causes,Illness (Aids/STD),Female,0-14,0
1,A & N Islands,2001,Causes,Bankruptcy or Sudden change in Economic,Female,0-14,0
2,A & N Islands,2001,Causes,Cancellation/Non-Settlement of Marriage,Female,0-14,0
3,A & N Islands,2001,Causes,Physical Abuse (Rape/Incest Etc.),Female,0-14,0
4,A & N Islands,2001,Causes,Dowry Dispute,Female,0-14,0
...,...,...,...,...,...,...,...
237514,West Bengal,2012,Social_Status,Seperated,Male,0-100+,149
237515,West Bengal,2012,Social_Status,Widowed/Widower,Male,0-100+,233
237516,West Bengal,2012,Social_Status,Married,Male,0-100+,5451
237517,West Bengal,2012,Social_Status,Divorcee,Male,0-100+,189
237518,West Bengal,2012,Social_Status,Never Married,Male,0-100+,2658

### Inspect DataFrame

In [5]:
data.shape

(237519, 7)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237519 entries, 0 to 237518
Data columns (total 7 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   State      237519 non-null  object
 1   Year       237519 non-null  int64
 2   Type_code  237519 non-null  object
 3   Type       237519 non-null  object
 4   Gender     237519 non-null  object
 5   Age_group  237519 non-null  object
 6   Total      237519 non-null  int64
dtypes: int64(2), object(5)
memory usage: 12.7+ MB

In [7]:
data.describe()

                Year          Total
count  237519.000000  237519.000000
mean     2006.500448      55.034477
std         3.452240     792.749038
min      2001.000000       0.000000
25%      2004.000000       0.000000
50%      2007.000000       0.000000
75%      2010.000000       6.000000
max      2012.000000   63343.000000

In [9]:
data['State'].describe()

count             237519
unique                38
top       Madhya Pradesh
freq                6792
Name: State, dtype: object

### 1. Total Suicides in India

In [10]:
data.Total.sum()

13071734

### 2. Total Suicides in India State wise

In [12]:
data.groupby('State').Total.sum().sort_values(ascending=False)

State
Total (All India)    2911862
Total (States)       2858026
Maharashtra           901945
West Bengal           849936
Tamil Nadu            818691
Andhra Pradesh        814059
Karnataka             734825
Kerala                538946
Madhya Pradesh        451535
Gujarat               330858
Chhattisgarh          302354
Odisha                267234
Rajasthan             255134
Uttar Pradesh         233352
Assam                 172276
Haryana               147176
Delhi (Ut)             84272
Total (Uts)            53836
Jharkhand              49720
Punjab                 46350
Bihar                  46214
Tripura                45965
Puducherry             32144
Himachal Pradesh       26562
Uttarakhand            18496
Goa                    17363
Jammu & Kashmir        14821
Sikkim                  9606
A & N Islands           8109
Arunachal Pradesh       6633
Meghalaya               5415
Chandigarh              5164
Mizoram                 4154
D & N Haveli            3430
Manipur                 2102
Nagaland                1728
Daman & Diu             1391
Lakshadweep               50
Name: Total, dtype: int64

### 3. Total Suicides in India Year wise

In [13]:
data.groupby('Year').Total.sum()

Year
2001     976464
2002     993648
2003     997622
2004    1023137
2005    1025201
2006    1062991
2007    1103667
2008    1125082
2009    1144033
2010    1211322
2011    1219499
2012    1189068
Name: Total, dtype: int64

### 4. Total Suicides in Gender Statewise

In [14]:
data.groupby('Gender').Total.sum()

Gender
Female    4702974
Male      8368760
Name: Total, dtype: int64

### 5. Total Suicides in India State Year wise

In [15]:
data.groupby(['State','Year']).Total.sum()

State          Year
A & N Islands  2001      645
               2002      720
               2003      565
               2004      610
               2005      695
                       ...
West Bengal    2008    74260
               2009    73240
               2010    80185
               2011    82460
               2012    44871
Name: Total, Length: 456, dtype: int64

In [17]:
data.groupby(['State','Year'])[['Total']].sum().to_html('index.html')

### 6. Total Suicides in India State Gender wise

In [19]:
data.groupby(['State','Gender'])[['Total']].sum()

                           Total
State             Gender
A & N Islands     Female    2750
                  Male      5359
Andhra Pradesh    Female  271939
                  Male    542120
Arunachal Pradesh Female    1954
...                          ...
Uttar Pradesh     Male    125327
Uttarakhand       Female    7548
                  Male     10948
West Bengal       Female  365241
                  Male    484695

[76 rows x 1 columns]


### 7. Total Suicides in India Year Gender wise

In [21]:
data.groupby(['Year','Gender'])[['Total']].sum()

              Total
Year Gender
2001 Female  379645
     Male    596819
2002 Female  369675
     Male    623973
2003 Female  365657
     Male    631965
2004 Female  369297
     Male    653840
2005 Female  368980
     Male    656221
2006 Female  381677
     Male    681314
2007 Female  390032
     Male    713635
2008 Female  400202
     Male    724880
2009 Female  411050
     Male    732983
2010 Female  426705
     Male    784617
2011 Female  429688
     Male    789811
2012 Female  410366
     Male    778702

### 8. Total Suicides in India State Year Gender wise

In [23]:
data.groupby(['State','Year','Gender'])[['Total']].sum()

                           Total
State         Year Gender
A & N Islands 2001 Female    250
                   Male      395
              2002 Female    265
                   Male      455
              2003 Female    215
...                          ...
West Bengal   2010 Male    46505
              2011 Female  34340
                   Male    48120
              2012 Female  18831
                   Male    26040

[912 rows x 1 columns]

### 9. Total Suicides in India Cause wise

In [26]:
data.groupby('Type').Total.sum().sort_values(ascending=False)

Type
Married                                           3065322
Primary                                           1088481
Middle                                            1028913
No Education                                       965271
Never Married                                      954903
                                                   ...
Bankruptcy or Sudden change in Economic Status       2655
Illegitimate Pregnancy                               2494
Ideological Causes/Hero Worshipping                  2118
By Machine                                           1661
Not having Children (Barrenness/Impotency             766
Name: Total, Length: 69, dtype: int64

In [27]:
data.groupby('Type').Total.sum().sort_values(ascending=False).head(10)

Type
Married                                     3065322
Primary                                     1088481
Middle                                      1028913
No Education                                 965271
Never Married                                954903
Matriculate/Secondary                        769698
Others (Please Specify)                      469147
By Hanging                                   460955
Hr. Secondary/Intermediate/Pre-Universit     356724
Family Problems                              341952
Name: Total, dtype: int64

### 10. Total Suicides in Punjab 2008

In [29]:
data[(data['State']=='Punjab') & (data['Year']==2008)].Total.sum()

4345

### 11. Total Suicides in Punjab 2008 due to Cancer

In [32]:
data[(data['State']=='Punjab') & (data['Year']==2008) & (data['Type']=='Cancer')].Total.sum()

2

### 12. Save Each State data in Separate CSV File

In [36]:
data[data['State']=='Punjab'].to_csv('Punjab.csv')

In [37]:
for state in data['State'].unique():
    data[data['State']==state].to_csv(state+'.csv')